comp-sci/sml/de-bruijn-index.org
#+TITLE: de Bruijn Indices - SML
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2022-12-31T08:57:47-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ../sml.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Saturday December 31, 2022 at  8:57AM

* Problem Statement
:PROPERTIES:
:CUSTOM_ID: h-a4e15c60-3817-479a-b174-e2165a8f8a78
:END:

The basic problem is to consider the untyped lambda calculus. How can we
encode it in Standard ML? The naive way runs into problems, for example:

$$(\lambda x . \lambda y . x y x y) (y y) \to_{\text{naive}} \lambda y . ((y y) y (y y) y)$$

This is incorrect, it should instead change the bound $y$ variable to
avoid accidentally capturing the free variable:

$$(\lambda x . \lambda y . x y x y) (y y) \to \lambda z . ((y y) z (y y) z)$$

How can we avoid the problem of accidental capture?

* Solution
:PROPERTIES:
:CUSTOM_ID: h-69f5b62a-bcd4-4de3-896c-0238934c797c
:END:

The approach De Bruijn took was to use numbers for bound
variables. (What do we do with free variables? Well...let's see how we
translate bound variables into numbers first.)

The idea is: a bound variable is replaced by a number counting how many
lambdas occur between the bound variable and its binder? For example,
the identity combinator's bound variable has nothing between it and its
binder, so we would encode it as:

$$ \lambda x . x \mapsto \lambda.0 $$

When there is 1 lambda between the bound variable and its binder:

$$ \lambda x . \lambda y . x \mapsto \lambda\lambda.1 $$

A tricky one:

$$ \lambda x.\lambda y.\lambda s.\lambda z.x s (y s z)\mapsto \lambda\lambda\lambda\lambda.3~1~(2~1~0)$$

The names of the bound variables do not matter:

$$(\lambda x . x~x)(\lambda y.y~y)\mapsto (\lambda.0~0)(\lambda.0~0)$$

This is the basic idea of de Bruijn indices.

** Translation Algorithm
:PROPERTIES:
:CUSTOM_ID: h-28efb67b-84c8-46d3-adde-08ba31d42dc5
:END:

The basic algorithm could be sketched out using an associative array (or
"dictionary") of bindings, which is called the {{{dfn(Context)}}} in the
literature.

*Step 1.* We initialize the context $\Gamma\gets\{\}$ and the binding
depth $\delta\gets 0$. We are given a lambda expression $e$ we will
translate to de Bruijn notation.

*Step 2.* (Handle variables.) If our expression is not a variable, go to
step 5. If our expression is a variable $e = x$, then we check if the
variable is in our context $x\in\Gamma$. If it is, go to step 4. If $e = x$
is free, then go to the next step.

*Step 3.* (Shift de Bruijn indices, add new binding.) If $e = x$ is not
in our existing context $x\notin\Gamma$, we add it, which means
we construct a new context by copying over all existing bindings with
the de Bruijn index shifted by 1, and assign $x$ the de Bruijn index of 0:
$\Gamma_{\text{new}} = \{(y,n+1)\mid (y,n)\in\Gamma\}\cup\{(x,0)\}$.
Set $\Gamma\gets\Gamma_{\text{new}}$ and move to the next step.

*Step 4.* (Swap variable for de Bruijn index.) Our expression is a
variable $e=x$ and our context has a binding for it $x\in\Gamma$. Then
we lookup the de Bruijn index in the context $\Gamma(x)=n$ and return
$n$ as the translation.

*Step 5.* If our expression $e$ is a lambda abstraction $e = \lambda x.e'$,
then we move on to step 6. Otherwise we move to step 7.

*Step 6.* Given a lambda abstraction for our expression $e = \lambda x.e'$,
we translate $x$ to a de Bruijn index and update our context --- exactly
as we have done in step 3. Using this new context $\Gamma_{\text{new}}$,
we translate the body of the abstraction $e'$ using this new context;
i.e., we set $e\gets e'$ and $\Gamma\gets\Gamma_{\text{new}}$, then
return to step 2. This produces a translation $e'\mapsto\widetilde{e}'$,
and we return $\lambda . \widetilde{e}'$ as the translation.

*Step 7.* The last possibility is that $e$ is an application of
expressions, so $e = e_{1}~e_{2}$. We can then, in parallel and separately,
construct two copies of the current context $\Gamma_{1}\gets\Gamma$ and
$\Gamma_{2}\gets\Gamma$, then concurrently return to step 2 with
(a) expression $e_{1}$ and context $\Gamma_{1}$, and
(b) expression $e_{2}$ and context $\Gamma_{2}$. This will translate the
subexpressions $e_{1}\mapsto\widetilde{e}_{1}$ and 
$e_{2}\mapsto\widetilde{e}_{2}$, then we return as our translation
the application $\widetilde{e}_{1}~\widetilde{e}_{2}$.

(End of Algorithm)

** Free Variables
:PROPERTIES:
:CUSTOM_ID: h-534e5fe2-7cfc-4354-bda2-23bfc766fbf3
:END:

What do we do with free variables? Well, the way it is handled
traditionally is to treat them as we have outlined: they are integers
larger than the number of binders. This has its problems if we wanted to
print out the resulting translation to the user, e.g., for debugging
purposes. 

