docs/comp-sci/sml/de-bruijn-index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>de Bruijn Indices - SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../sml.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">de Bruijn Indices - SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-a4e15c60-3817-479a-b174-e2165a8f8a78">1. Problem Statement</a></li>
<li><a href="#h-69f5b62a-bcd4-4de3-896c-0238934c797c">2. Solution</a>
<ul>
<li><a href="#h-28efb67b-84c8-46d3-adde-08ba31d42dc5">2.1. Translation Algorithm</a></li>
<li><a href="#h-534e5fe2-7cfc-4354-bda2-23bfc766fbf3">2.2. Free Variables</a></li>
<li><a href="#h-1a0cf8ac-e24a-416e-905d-4549fd236a31">2.3. Substitution</a></li>
</ul>
</li>
<li><a href="#h-16502c44-ef38-4b5c-8cc9-577a9621f5d2">3. Locally Nameless Variables</a></li>
<li><a href="#h-0825b3d3-5d90-4f57-b3ff-bec320045ec1">4. HOAS, PHOAS, etc.</a></li>
<li><a href="#h-3761a02f-4b76-4769-a18f-defd3cc8d6be">5. &#x2026;and <i>Typed</i> Lambda Calculus</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-a4e15c60-3817-479a-b174-e2165a8f8a78" class="outline-2">
<h2 id="h-a4e15c60-3817-479a-b174-e2165a8f8a78"><span class="section-number-2">1.</span> Problem Statement</h2>
<div class="outline-text-2" id="text-h-a4e15c60-3817-479a-b174-e2165a8f8a78">
<p>
The basic problem is to consider the untyped lambda calculus. How can we
encode it in Standard ML? The naive way runs into problems, for example:
</p>

<p>
\[(\lambda x . \lambda y . x y x y) (y y) \to_{\text{naive}} \lambda y . ((y y) y (y y) y)\]
</p>

<p>
This is incorrect, it should instead change the bound \(y\) variable to
avoid accidentally capturing the free variable:
</p>

<p>
\[(\lambda x . \lambda y . x y x y) (y y) \to \lambda z . ((y y) z (y y) z)\]
</p>

<p>
How can we avoid the problem of accidental capture?
</p>
</div>
</div>

<div id="outline-container-h-69f5b62a-bcd4-4de3-896c-0238934c797c" class="outline-2">
<h2 id="h-69f5b62a-bcd4-4de3-896c-0238934c797c"><span class="section-number-2">2.</span> Solution</h2>
<div class="outline-text-2" id="text-h-69f5b62a-bcd4-4de3-896c-0238934c797c">
<p>
The approach De Bruijn took was to use numbers for bound
variables. (What do we do with free variables? Well&#x2026;let's see how we
translate bound variables into numbers first.)
</p>

<p>
The idea is: a bound variable is replaced by a number counting how many
lambdas occur between the bound variable and its binder? For example,
the identity combinator's bound variable has nothing between it and its
binder, so we would encode it as:
</p>

<p>
\[ \lambda x . x \mapsto \lambda.0 \]
</p>

<p>
When there is 1 lambda between the bound variable and its binder:
</p>

<p>
\[ \lambda x . \lambda y . x \mapsto \lambda\lambda.1 \]
</p>

<p>
A tricky one:
</p>

<p>
\[ \lambda x.\lambda y.\lambda s.\lambda z.x s (y s z)\mapsto \lambda\lambda\lambda\lambda.3~1~(2~1~0)\]
</p>

<p>
The names of the bound variables do not matter:
</p>

<p>
\[(\lambda x . x~x)(\lambda y.y~y)\mapsto (\lambda.0~0)(\lambda.0~0)\]
</p>

<p>
This is the basic idea of de Bruijn indices.
</p>
</div>

<div id="outline-container-h-28efb67b-84c8-46d3-adde-08ba31d42dc5" class="outline-3">
<h3 id="h-28efb67b-84c8-46d3-adde-08ba31d42dc5"><span class="section-number-3">2.1.</span> Translation Algorithm</h3>
<div class="outline-text-3" id="text-h-28efb67b-84c8-46d3-adde-08ba31d42dc5">
<p>
The basic algorithm could be sketched out using an associative array (or
"dictionary") of bindings, which is called the <dfn>Context</dfn> in the
literature.
</p>

<p>
<b>Step 1.</b> We initialize the context \(\Gamma\gets\{\}\) and the binding
depth \(\delta\gets 0\). We are given a lambda expression \(e\) we will
translate to de Bruijn notation.
</p>

<p>
<b>Step 2.</b> (Handle variables.) If our expression is not a variable, go to
step 5. If our expression is a variable \(e = x\), then we check if the
variable is in our context \(x\in\Gamma\). If it is, go to step 4. If \(e = x\)
is free, then go to the next step.
</p>

<p>
<b>Step 3.</b> (Shift de Bruijn indices, add new binding.) If \(e = x\) is not
in our existing context \(x\notin\Gamma\), we add it, which means
we construct a new context by copying over all existing bindings with
the de Bruijn index shifted by 1, and assign \(x\) the de Bruijn index of 0:
\(\Gamma_{\text{new}} = \{(y,n+1)\mid (y,n)\in\Gamma\}\cup\{(x,0)\}\).
Set \(\Gamma\gets\Gamma_{\text{new}}\) and move to the next step.
</p>

<p>
<b>Step 4.</b> (Swap variable for de Bruijn index.) Our expression is a
variable \(e=x\) and our context has a binding for it \(x\in\Gamma\). Then
we lookup the de Bruijn index in the context \(\Gamma(x)=n\) and return
\(n\) as the translation.
</p>

<p>
<b>Step 5.</b> If our expression \(e\) is a lambda abstraction \(e = \lambda x.e'\),
then we move on to step 6. Otherwise we move to step 7.
</p>

<p>
<b>Step 6.</b> Given a lambda abstraction for our expression \(e = \lambda x.e'\),
we translate \(x\) to a de Bruijn index and update our context &#x2014; exactly
as we have done in step 3. Using this new context \(\Gamma_{\text{new}}\),
we translate the body of the abstraction \(e'\) using this new context;
i.e., we set \(e\gets e'\) and \(\Gamma\gets\Gamma_{\text{new}}\), then
return to step 2. This produces a translation \(e'\mapsto\widetilde{e}'\),
and we return \(\lambda . \widetilde{e}'\) as the translation.
</p>

<p>
<b>Step 7.</b> The last possibility is that \(e\) is an application of
expressions, so \(e = e_{1}~e_{2}\). We can then, in parallel and separately,
construct two copies of the current context \(\Gamma_{1}\gets\Gamma\) and
\(\Gamma_{2}\gets\Gamma\), then concurrently return to step 2 with
(a) expression \(e_{1}\) and context \(\Gamma_{1}\), and
(b) expression \(e_{2}\) and context \(\Gamma_{2}\). This will translate the
subexpressions \(e_{1}\mapsto\widetilde{e}_{1}\) and 
\(e_{2}\mapsto\widetilde{e}_{2}\), then we return as our translation
the application \(\widetilde{e}_{1}~\widetilde{e}_{2}\).
</p>

<p>
(End of Algorithm)
</p>
</div>
</div>

<div id="outline-container-h-534e5fe2-7cfc-4354-bda2-23bfc766fbf3" class="outline-3">
<h3 id="h-534e5fe2-7cfc-4354-bda2-23bfc766fbf3"><span class="section-number-3">2.2.</span> Free Variables</h3>
<div class="outline-text-3" id="text-h-534e5fe2-7cfc-4354-bda2-23bfc766fbf3">
<p>
What do we do with free variables? Well, the way it is handled
traditionally is to treat them as we have outlined: they are integers
larger than the number of binders. This has its problems if we wanted to
print out the resulting translation to the user, e.g., for debugging
purposes. 
</p>
</div>
</div>
