comp-sci/sml/de-bruijn-index.org
** Substitution
:PROPERTIES:
:CUSTOM_ID: h-1a0cf8ac-e24a-416e-905d-4549fd236a31
:END:

But this begs the question: how does substitution work in de Bruijn
indices?

We see that $(\lambda x.\lambda y.x)e\to\lambda y.e$; with de Bruijn
indices, we would have $(\lambda\lambda.1)\widetilde{e}$ translated...how?
Well, we begin by realizing $x$ has been replaced initially by 0, so we
would write:
$$ (\lambda\lambda.1)\widetilde{e}\to (\lambda.1)[0 := \widetilde{e}]$$
This gets the ball rolling. Next, we need to move the substitution
through the lambda binder. This would increment the de Bruijn index for
the bound variable we are substituting for:
$$ (\lambda.1)[0 := \widetilde{e}] \stackrel{?}{=} \lambda.(1[1 := \widetilde{e}])$$
Would this work? Care must be taken with free variables in $\widetilde{e}$,
we must make sure they remain free.

For a ground term $\widetilde{e}$, we can simply work with care-free
abandon, replacing $1$ by $\widetilde{e}$, and we're finished.

For an expression $\widetilde{e}$ with free variables, then we run into
problems. Really? Well, take $\widetilde{e}=0$. Then we would have
$$ (\lambda.1)[0 := 0] \stackrel{?}{=} \lambda.(1[1 := 0]) = \lambda.0 $$
This is *not* equal to the translation of $(\lambda x.\lambda y.x)x$ into de Bruijn
indices. What happened?

Well, free variables screwed everything up. We need to keep free
variables /free/. That is, we need to keep their value above the "depth"
of binders.

We introduce a notion of {{{dfn(shift operator)}}} $\uparrow^{n}_{c}$
which increments de Bruijn indices at or above the cutoff $c$ by an
amount $n$. We define it inductively by the rules:

$$ \uparrow^{n}_{c}(m) = \begin{cases}m & \mbox{if }m\lt c\\ m + n & \mbox{otherwise}\end{cases} $$
$$ \uparrow^{n}_{c}(\lambda.e) = \lambda.(\uparrow^{n}_{c+1}(e))$$
$$ \uparrow^{n}_{c}(e_{1}~e_{2}) = \uparrow^{n}_{c}(e_{1})~\uparrow^{n}_{c}(e_{2})$$

Observe, if we want to shift free variables by 1 in an expression, we
would write $\uparrow^{1}_{0}(e)$. The cutoff starts at $c=0$, but will
increment to reflect the "binder depth" of the subexpression.

Substitution, using the shift function, is then defined by:

$$ m [n := e] = \begin{cases} e & \mbox{if }m=n\\m &\mbox{otherwise}\end{cases}$$
$$ (\lambda.e_{1})[n := e] = \lambda.(e_{1}[m+1 := \uparrow^{1}_{0}(e)])$$
$$ (e_{1}~e_{2})[n := e] = (e_{1}[n := e])~(e_{2}[n := e])$$

Does this fix our situation? We should observe our /naive/ attempt at
substitution has $(\lambda.e_{1})[n := e] = \lambda.(e_{1}[m+1 := e])$,
so the shift function is used /only/ when substituting into a lambda
expression. We also see that we shift all variables above a cutoff
$c=0$, i.e., we shift all /free variables/ by 1. Therefore, we /expect/
this should work.

We see for our particular expression:

$$ (\lambda\lambda.1)0 = (\lambda.1)[0 := 0] $$

Then applying our rules for substitution:

$$ (\lambda.1)[0 := 0] = \lambda.(1[0 + 1 := \uparrow^{1}_{0}(0)]) = \lambda.(1[1 := 1]). $$

Thus we find:

$$ (\lambda\lambda.1)0\to\lambda.1 $$

This works as we expected! ...for one simple example. If we had a
different context, where $x$ were translated to $n$, then we would have instead:

$$ (\lambda\lambda.1)n\to\lambda.(n+1) $$

...which is right. We would therefore need to shift down
by 1. That is to say, we would need beta reduction to be defined as:

\begin{equation}
(\lambda.e_{1})e_{2}\to_{\beta} \uparrow^{-1}_{0}(e_{1}[0 := \uparrow^{1}_{0}(e_{2})])
\end{equation}

Wait, would this work with our original situation? Let us evaluate:

$$ (\lambda\lambda.1)n\to_{\beta}\uparrow^{-1}_{0}((\lambda.1)[0 := n+1])$$
$$ \uparrow^{-1}_{0}((\lambda.1)[0 := n+1]) = \uparrow^{-1}_{0}(\lambda.(1[0 + 1 := \uparrow^{1}_{0}(n+1)]))$$
$$ \uparrow^{-1}_{0}(\lambda.(1[0 + 1 := \uparrow^{1}_{0}(n+1)])) = \uparrow^{-1}_{0}(\lambda.(1[1 := n+2]))$$
$$ \uparrow^{-1}_{0}(\lambda.(1[1 := n+2])) = \uparrow^{-1}_{0}(\lambda.n+2)$$
$$ \uparrow^{-1}_{0}(\lambda.n+2) = \lambda.\uparrow^{-1}_{1}(n+2)$$
$$ \lambda.\uparrow^{-1}_{1}(n+2) = \lambda.(n+1) $$

Without the outermost $\uparrow^{-1}_{0}(\dots)$, we would have obtained
the incorrect solution. Without the innermost $\uparrow^{1}_{0}(\dots)$,
we would have mistaken the free variable $0$ for a bound
variable. Therefore, we are forced to admit the beta-reduction rule as proposed.

* Locally Nameless Variables
:PROPERTIES:
:CUSTOM_ID: h-16502c44-ef38-4b5c-8cc9-577a9621f5d2
:END:

This is a big old mess, all caused by free variables. What if we
just...leave free variables alone? Treat them as strings? Then we won't
have to worry about shifting and unshifting in beta
reduction. But we have two notions of variables --- free variables and
bound ones.

#+begin_src sml
datatype Name = Bound of int
       | Free of string;

datatype Expr = Var of Name
       | Lam of Expr
       | App of Expr * Expr;
#+end_src

We then substitute an expression for a name.

#+begin_src sml
fun subst e' x@(Free n) = (fn e@(Var (Free y)) => if n = y then e' else e
                        | e@(Var _) => e
                        | (Lam e) => Lam (subst e' x e)
                        | (App (e1, e2)) => App (subst e' x e1, subst e' x e2))
  | subst e' x@(Bound n) = (fn e@(Var (Bound m)) => if m = n then e' else e
                           | e@(Var _) => e
                           | (Lam e) => Lam (subst e' (Bound (n+1)) e)
                           | (App (e1, e2)) => App (subst e' x e1, subst e' x e2));
#+end_src

Actually, since both ~int~ and ~string~ are equality types, we can
simplify this code quite a bit:

#+begin_src sml
fun shift (Bound n) = Bound (n + 1)
  | shift e = e;

fun subst (e' : Expr) (x : Name) =
    (fn e@(Var y) => if x = y then e' else e
    | (Lam e) => Lam (subst e' (shift x) e)
    | (App (e1, e2)) => App (subst e' x e1, subst e' x e2));
#+end_src

That's it, we've got the substitution mechanism, and now beta reduction
simplifies to:

#+begin_src sml
fun beta e@(Var _) = e
  | beta e@(Lam _) = e
  | beta e@(App (e1, e2)) = case e1 of
                            | (Var _) => e
                            | (Lam e') => subst e2 (Bound 0) e'
                            | (App (e11, e12)) =>
                              let val v1 = beta e1
                              in if e1 = v1 then e else beta (App (v1, e2))
                              end;
#+end_src

We should probably add some logic to avoid infinite loops with beta
reduction, but this illustrates the mechanics of locally nameless
variables.

