docs/comp-sci/sml/de-bruijn-index.html

<div id="outline-container-h-1a0cf8ac-e24a-416e-905d-4549fd236a31" class="outline-3">
<h3 id="h-1a0cf8ac-e24a-416e-905d-4549fd236a31"><span class="section-number-3">2.3.</span> Substitution</h3>
<div class="outline-text-3" id="text-h-1a0cf8ac-e24a-416e-905d-4549fd236a31">
<p>
But this begs the question: how does substitution work in de Bruijn
indices?
</p>

<p>
We see that \((\lambda x.\lambda y.x)e\to\lambda y.e\); with de Bruijn
indices, we would have \((\lambda\lambda.1)\widetilde{e}\) translated&#x2026;how?
Well, we begin by realizing \(x\) has been replaced initially by 0, so we
would write:
\[ (\lambda\lambda.1)\widetilde{e}\to (\lambda.1)[0 := \widetilde{e}]\]
This gets the ball rolling. Next, we need to move the substitution
through the lambda binder. This would increment the de Bruijn index for
the bound variable we are substituting for:
\[ (\lambda.1)[0 := \widetilde{e}] \stackrel{?}{=} \lambda.(1[1 := \widetilde{e}])\]
Would this work? Care must be taken with free variables in \(\widetilde{e}\),
we must make sure they remain free.
</p>

<p>
For a ground term \(\widetilde{e}\), we can simply work with care-free
abandon, replacing \(1\) by \(\widetilde{e}\), and we're finished.
</p>

<p>
For an expression \(\widetilde{e}\) with free variables, then we run into
problems. Really? Well, take \(\widetilde{e}=0\). Then we would have
\[ (\lambda.1)[0 := 0] \stackrel{?}{=} \lambda.(1[1 := 0]) = \lambda.0 \]
This is <b>not</b> equal to the translation of \((\lambda x.\lambda y.x)x\) into de Bruijn
indices. What happened?
</p>

<p>
Well, free variables screwed everything up. We need to keep free
variables <i>free</i>. That is, we need to keep their value above the "depth"
of binders.
</p>

<p>
We introduce a notion of <dfn>shift operator</dfn> \(\uparrow^{n}_{c}\)
which increments de Bruijn indices at or above the cutoff \(c\) by an
amount \(n\). We define it inductively by the rules:
</p>

<p>
\[ \uparrow^{n}_{c}(m) = \begin{cases}m & \mbox{if }m\lt c\\ m + n & \mbox{otherwise}\end{cases} \]
\[ \uparrow^{n}_{c}(\lambda.e) = \lambda.(\uparrow^{n}_{c+1}(e))\]
\[ \uparrow^{n}_{c}(e_{1}~e_{2}) = \uparrow^{n}_{c}(e_{1})~\uparrow^{n}_{c}(e_{2})\]
</p>

<p>
Observe, if we want to shift free variables by 1 in an expression, we
would write \(\uparrow^{1}_{0}(e)\). The cutoff starts at \(c=0\), but will
increment to reflect the "binder depth" of the subexpression.
</p>

<p>
Substitution, using the shift function, is then defined by:
</p>

<p>
\[ m [n := e] = \begin{cases} e & \mbox{if }m=n\\m &\mbox{otherwise}\end{cases}\]
\[ (\lambda.e_{1})[n := e] = \lambda.(e_{1}[m+1 := \uparrow^{1}_{0}(e)])\]
\[ (e_{1}~e_{2})[n := e] = (e_{1}[n := e])~(e_{2}[n := e])\]
</p>

<p>
Does this fix our situation? We should observe our <i>naive</i> attempt at
substitution has \((\lambda.e_{1})[n := e] = \lambda.(e_{1}[m+1 := e])\),
so the shift function is used <i>only</i> when substituting into a lambda
expression. We also see that we shift all variables above a cutoff
\(c=0\), i.e., we shift all <i>free variables</i> by 1. Therefore, we <i>expect</i>
this should work.
</p>

<p>
We see for our particular expression:
</p>

<p>
\[ (\lambda\lambda.1)0 = (\lambda.1)[0 := 0] \]
</p>

<p>
Then applying our rules for substitution:
</p>

<p>
\[ (\lambda.1)[0 := 0] = \lambda.(1[0 + 1 := \uparrow^{1}_{0}(0)]) = \lambda.(1[1 := 1]). \]
</p>

<p>
Thus we find:
</p>

<p>
\[ (\lambda\lambda.1)0\to\lambda.1 \]
</p>

<p>
This works as we expected! &#x2026;for one simple example. If we had a
different context, where \(x\) were translated to \(n\), then we would have instead:
</p>

<p>
\[ (\lambda\lambda.1)n\to\lambda.(n+1) \]
</p>

<p>
&#x2026;which is right. We would therefore need to shift down
by 1. That is to say, we would need beta reduction to be defined as:
</p>

\begin{equation}
(\lambda.e_{1})e_{2}\to_{\beta} \uparrow^{-1}_{0}(e_{1}[0 := \uparrow^{1}_{0}(e_{2})])
\end{equation}

<p>
Wait, would this work with our original situation? Let us evaluate:
</p>

<p>
\[ (\lambda\lambda.1)n\to_{\beta}\uparrow^{-1}_{0}((\lambda.1)[0 := n+1])\]
\[ \uparrow^{-1}_{0}((\lambda.1)[0 := n+1]) = \uparrow^{-1}_{0}(\lambda.(1[0 + 1 := \uparrow^{1}_{0}(n+1)]))\]
\[ \uparrow^{-1}_{0}(\lambda.(1[0 + 1 := \uparrow^{1}_{0}(n+1)])) = \uparrow^{-1}_{0}(\lambda.(1[1 := n+2]))\]
\[ \uparrow^{-1}_{0}(\lambda.(1[1 := n+2])) = \uparrow^{-1}_{0}(\lambda.n+2)\]
\[ \uparrow^{-1}_{0}(\lambda.n+2) = \lambda.\uparrow^{-1}_{1}(n+2)\]
\[ \lambda.\uparrow^{-1}_{1}(n+2) = \lambda.(n+1) \]
</p>

<p>
Without the outermost \(\uparrow^{-1}_{0}(\dots)\), we would have obtained
the incorrect solution. Without the innermost \(\uparrow^{1}_{0}(\dots)\),
we would have mistaken the free variable \(0\) for a bound
variable. Therefore, we are forced to admit the beta-reduction rule as proposed.
</p>
</div>
</div>
</div>

<div id="outline-container-h-16502c44-ef38-4b5c-8cc9-577a9621f5d2" class="outline-2">
<h2 id="h-16502c44-ef38-4b5c-8cc9-577a9621f5d2"><span class="section-number-2">3.</span> Locally Nameless Variables</h2>
<div class="outline-text-2" id="text-h-16502c44-ef38-4b5c-8cc9-577a9621f5d2">
<p>
This is a big old mess, all caused by free variables. What if we
just&#x2026;leave free variables alone? Treat them as strings? Then we won't
have to worry about shifting and unshifting in beta
reduction. But we have two notions of variables &#x2014; free variables and
bound ones.
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">datatype</span> <span class="org-type-def">Name</span> = Bound <span class="org-keyword">of</span> int
       | Free <span class="org-keyword">of</span> string;

<span class="org-keyword">datatype</span> <span class="org-type-def">Expr</span> = Var <span class="org-keyword">of</span> Name
       | Lam <span class="org-keyword">of</span> Expr
       | App <span class="org-keyword">of</span> Expr * Expr;
</pre>
</div>

<p>
We then substitute an expression for a name.
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">subst</span> e' x@(Free n) = (<span class="org-keyword">fn</span> e@(Var (Free y)) =&gt; <span class="org-keyword">if</span> n = y <span class="org-keyword">then</span> e' <span class="org-keyword">else</span> e
                        | e@(Var _) =&gt; e
                        | (Lam e) =&gt; Lam (subst e' x e)
                        | (App (e1, e2)) =&gt; App (subst e' x e1, subst e' x e2))
  | subst e' x@(Bound n) = (<span class="org-keyword">fn</span> e@(Var (Bound m)) =&gt; <span class="org-keyword">if</span> m = n <span class="org-keyword">then</span> e' <span class="org-keyword">else</span> e
                           | e@(Var _) =&gt; e
                           | (Lam e) =&gt; Lam (subst e' (Bound (n+1)) e)
                           | (App (e1, e2)) =&gt; App (subst e' x e1, subst e' x e2));
</pre>
</div>

<p>
Actually, since both <code>int</code> and <code>string</code> are equality types, we can
simplify this code quite a bit:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">shift</span> (Bound n) = Bound (n + 1)
  | shift e = e;

<span class="org-keyword">fun</span> <span class="org-function-name">subst</span> (e' : Expr) (x : Name) =
    (<span class="org-keyword">fn</span> e@(Var y) =&gt; <span class="org-keyword">if</span> x = y <span class="org-keyword">then</span> e' <span class="org-keyword">else</span> e
    | (Lam e) =&gt; Lam (subst e' (shift x) e)
    | (App (e1, e2)) =&gt; App (subst e' x e1, subst e' x e2));
</pre>
</div>

<p>
That's it, we've got the substitution mechanism, and now beta reduction
simplifies to:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">beta</span> e@(Var _) = e
  | beta e@(Lam _) = e
  | beta e@(App (e1, e2)) = <span class="org-keyword">case</span> e1 <span class="org-keyword">of</span>
                            | (Var _) =&gt; e
                            | (Lam e') =&gt; subst e2 (Bound 0) e'
                            | (App (e11, e12)) =&gt;
                              <span class="org-keyword">let</span> <span class="org-keyword">val</span> <span class="org-variable-name">v1</span> = beta e1
                              <span class="org-keyword">in</span> <span class="org-keyword">if</span> e1 = v1 <span class="org-keyword">then</span> e <span class="org-keyword">else</span> beta (App (v1, e2))
                              <span class="org-keyword">end</span>;
</pre>
</div>

<p>
We should probably add some logic to avoid infinite loops with beta
reduction, but this illustrates the mechanics of locally nameless
variables.
</p>
</div>
</div>
