comp-sci/sml/de-bruijn-index.org
* HOAS, PHOAS, etc.
:PROPERTIES:
:CUSTOM_ID: h-0825b3d3-5d90-4f57-b3ff-bec320045ec1
:END:

A more sophisticated approach to encoding binders, free and bound
variables, etc., is to piggieback off the programming language. This
assumes the type system is sufficiently powerful. For Standard ML, we
lack sufficient strength.

For a SML library useful for a runtime HOAS/PHOAS encoding, see:

- Umut A. Acar, Guy E. Blelloch, Robert Harper,\\
  "Selective Memoization".\\
  {{{arXiv(1106.0447)}}}, 31 pages.

* ...and /Typed/ Lambda Calculus
:PROPERTIES:
:CUSTOM_ID: h-3761a02f-4b76-4769-a18f-defd3cc8d6be
:END:

Thus far, we have worked with locally nameless variables for untyped
lambda calculus. What happens if we add types?

At the very least, we would need to add the type of the bound variable
to ~Lam~ (lambda abstraction). This minimal approach would require us to
typecheck expressions to make sure evaluation makes sense ("works").

We could equally do something like:
#+begin_src sml
type Name = string;
(* datatype Var = ... *) (* The implementation is immaterial *)

datatype Type =
         | TArr of Type * Type
         (* | other base types... *)
         | TBool;

datatype Term =
       | Const of boolean
       | Var of Name
       | Abs of Type * Term
       | App of Term * Term;
#+end_src

If we wanted to use locally nameless variables for polymorphic lambda
calculus, we would have something like:

#+begin_src sml
type Name = string;
datatype Var = (* ... *) (* The implementation is immaterial *)

datatype Sort = (* complicated mess *);

datatype Type =
         | Ty Name * (Type list)
         | TVar Var * Sort;

datatype Term =
         | Const Name * Type
         | FVar Var * Type
         | BVar int
         | Abs Type * Term
         | App Term * Term;
#+end_src

This is, after all, what happens in:

- Tobias Nipkow, Simon Roßkopf,\\
  "Isabelle's Metalogic: Formalization and Proof Checker".\\
  {{{arXiv(2104.12224)}}}, 18 pages.

For first-order dependently-typed lambda calculus (LF or its variants),
then I believe we need to define the ~Type~ and ~Term~ datatypes
simultaneously. For example, formalizing de Groote's
$\lambda^{\lambda}$ (from his paper "Defining λ-Typed λ-Calculi
by Axiomatizing the Typing Relation"), we would need something like:

#+begin_src sml
datatype Expr =
         | EType
         | EVar of Var
         | ELam of Expr * Expr
         | EApp of Expr * Expr
     and Type =
         | TKind
         | TLam of Expr * Type;
#+end_src

Or perhaps more succinctly using one datatype for pseudo-expressions:

#+begin_src sml
datatype Expr =
         | Type
         | Kind
         | Var of Var
         | Lam of Expr * Expr
         | App of Expr * Expr;
#+end_src

It's probably wise to use opaque types, then make certain constructors
public, so as to avoid passing off illegal pseudoexpressions as
perfectly valid expressions.