docs/comp-sci/sml/de-bruijn-index.html

<div id="outline-container-h-0825b3d3-5d90-4f57-b3ff-bec320045ec1" class="outline-2">
<h2 id="h-0825b3d3-5d90-4f57-b3ff-bec320045ec1"><span class="section-number-2">4.</span> HOAS, PHOAS, etc.</h2>
<div class="outline-text-2" id="text-h-0825b3d3-5d90-4f57-b3ff-bec320045ec1">
<p>
A more sophisticated approach to encoding binders, free and bound
variables, etc., is to piggieback off the programming language. This
assumes the type system is sufficiently powerful. For Standard ML, we
lack sufficient strength.
</p>

<p>
For a SML library useful for a runtime HOAS/PHOAS encoding, see:
</p>

<ul class="org-ul">
<li>Umut A. Acar, Guy E. Blelloch, Robert Harper,<br>
"Selective Memoization".<br>
<a href="https://arxiv.org/abs/1106.0447">arXiv:1106.0447</a>, 31 pages.</li>
</ul>
</div>
</div>

<div id="outline-container-h-3761a02f-4b76-4769-a18f-defd3cc8d6be" class="outline-2">
<h2 id="h-3761a02f-4b76-4769-a18f-defd3cc8d6be"><span class="section-number-2">5.</span> &#x2026;and <i>Typed</i> Lambda Calculus</h2>
<div class="outline-text-2" id="text-h-3761a02f-4b76-4769-a18f-defd3cc8d6be">
<p>
Thus far, we have worked with locally nameless variables for untyped
lambda calculus. What happens if we add types?
</p>

<p>
At the very least, we would need to add the type of the bound variable
to <code>Lam</code> (lambda abstraction). This minimal approach would require us to
typecheck expressions to make sure evaluation makes sense ("works").
</p>

<p>
We could equally do something like:
</p>
<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">type</span> <span class="org-type-def">Name</span> = string;
<span class="org-comment-delimiter">(* </span><span class="org-comment">datatype Var = ...</span><span class="org-comment-delimiter"> *)</span> <span class="org-comment-delimiter">(* </span><span class="org-comment">The implementation is immaterial</span><span class="org-comment-delimiter"> *)</span>

<span class="org-keyword">datatype</span> <span class="org-type-def">Type</span> =
         | TArr <span class="org-keyword">of</span> Type * Type
         <span class="org-comment-delimiter">(* </span><span class="org-comment">| other base types...</span><span class="org-comment-delimiter"> *)</span>
         | TBool;

<span class="org-keyword">datatype</span> <span class="org-type-def">Term</span> =
       | Const <span class="org-keyword">of</span> boolean
       | Var <span class="org-keyword">of</span> Name
       | Abs <span class="org-keyword">of</span> Type * Term
       | App <span class="org-keyword">of</span> Term * Term;
</pre>
</div>

<p>
If we wanted to use locally nameless variables for polymorphic lambda
calculus, we would have something like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">type</span> <span class="org-type-def">Name</span> = string;
<span class="org-keyword">datatype</span> <span class="org-type-def">Var</span> = <span class="org-comment-delimiter">(* </span><span class="org-comment">...</span><span class="org-comment-delimiter"> *)</span> <span class="org-comment-delimiter">(* </span><span class="org-comment">The implementation is immaterial</span><span class="org-comment-delimiter"> *)</span>

<span class="org-keyword">datatype</span> <span class="org-type-def">Sort</span> = <span class="org-comment-delimiter">(* </span><span class="org-comment">complicated mess</span><span class="org-comment-delimiter"> *)</span>;

<span class="org-keyword">datatype</span> <span class="org-type-def">Type</span> =
         | Ty Name * (Type list)
         | TVar Var * Sort;

<span class="org-keyword">datatype</span> <span class="org-type-def">Term</span> =
         | Const Name * Type
         | FVar Var * Type
         | BVar int
         | Abs Type * Term
         | App Term * Term;
</pre>
</div>

<p>
This is, after all, what happens in:
</p>

<ul class="org-ul">
<li>Tobias Nipkow, Simon Roßkopf,<br>
"Isabelle's Metalogic: Formalization and Proof Checker".<br>
<a href="https://arxiv.org/abs/2104.12224">arXiv:2104.12224</a>, 18 pages.</li>
</ul>

<p>
For first-order dependently-typed lambda calculus (LF or its variants),
then I believe we need to define the <code>Type</code> and <code>Term</code> datatypes
simultaneously. For example, formalizing de Groote's
\(\lambda^{\lambda}\) (from his paper "Defining λ-Typed λ-Calculi
by Axiomatizing the Typing Relation"), we would need something like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">datatype</span> <span class="org-type-def">Expr</span> =
         | EType
         | EVar <span class="org-keyword">of</span> Var
         | ELam <span class="org-keyword">of</span> Expr * Expr
         | EApp <span class="org-keyword">of</span> Expr * Expr
     <span class="org-keyword">and</span> Type =
         | TKind
         | TLam <span class="org-keyword">of</span> Expr * Type;
</pre>
</div>

<p>
Or perhaps more succinctly using one datatype for pseudo-expressions:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">datatype</span> <span class="org-type-def">Expr</span> =
         | Type
         | Kind
         | Var <span class="org-keyword">of</span> Var
         | Lam <span class="org-keyword">of</span> Expr * Expr
         | App <span class="org-keyword">of</span> Expr * Expr;
</pre>
</div>

<p>
It's probably wise to use opaque types, then make certain constructors
public, so as to avoid passing off illegal pseudoexpressions as
perfectly valid expressions.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-01-18 Wed 09:04.</p>
</div>
</body>
</html>